Week7/W7D3/ryan_lynch_rails_olympics/build_rails_project/BlogApp/app/controllers/blogs_controller.rb

    def show
        @blog = Blog.find(self.params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        blog = Blog.new(title: params[:blog][:title], body: params[:blog][:body], author_id: params[:blog][:author_id])
        if blog.save
---
INSERT INTO "blogs" ("title", "author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "saddassad"], ["author_id", 1], ["body", "sdaadsdsasda"], ["created_at", "2019-09-20 23:06:21.734593"], ["updated_at", "2019-09-20 23:06:21.734593"]]

    def destroy
        blog = Blog.find(self.params[:id])
        blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 72]]